# config.py

# Розкладка текстури Dice.png
TILE_COLS = 4
TILE_ROWS = 3
TILE_WIDTH = 1.0 / TILE_COLS
TILE_HEIGHT = 1.0 / TILE_ROWS

# Відповідність граней текстурі
FACE_TILES = [
    (2, 0),  # top → 3
    (2, 2),  # bottom → 4
    (0, 1),  # left → 1
    (2, 1),  # front → 6
    (1, 1),  # right → 2
    (3, 1),  # back → 5
]

# Обертання кубика для відображення певної грані
DICE_ROTATIONS = {
    1: (0, 90, 0),
    2: (0, -90, 0),
    3: (-90, 0, 0),
    4: (90, 0, 0),
    5: (180, 0, 0),
    6: (0, 0, 0),
}

# Початкові позиції кубиків
CUBE_POSITIONS = [
    (-4, 0, -2), (0, 0, -2), (4, 0, -2),
    (-4, 0, 2), (0, 0, 2), (4, 0, 2)
]
